Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

OpenTofu will perform the following actions:

  # module.mongodb.mongodbatlas_advanced_cluster.cluster["discord-bot"] will be updated in-place
  # (imported from "65d4a3bf160f504f2547c2cd-discord-bot")
~ resource "mongodbatlas_advanced_cluster" "cluster" {
        advanced_configuration               = {
            change_stream_options_pre_and_post_images_expire_after_seconds = -1
            custom_openssl_cipher_config_tls12                             = []
            default_write_concern                                          = ""
            javascript_enabled                                             = true
            minimum_enabled_tls_protocol                                   = "TLS1_2"
            no_table_scan                                                  = false
            oplog_min_retention_hours                                      = 0
            oplog_size_mb                                                  = 0
            sample_refresh_interval_bi_connector                           = 0
            sample_size_bi_connector                                       = 0
            tls_cipher_config_mode                                         = "DEFAULT"
            transaction_lifetime_limit_seconds                             = 0
        }
        backup_enabled                       = false
        bi_connector_config                  = {
            enabled         = false
            read_preference = "secondary"
        }
        cluster_id                           = "65d4b78131917a0c1418cf5c"
        cluster_type                         = "REPLICASET"
      ~ connection_strings                   = {
          ~ private          = "" -> (known after apply)
          + private_endpoint = (known after apply)
          ~ private_srv      = "" -> (known after apply)
          ~ standard         = "mongodb://ac-qoo4yfi-shard-00-00.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-01.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-02.9jyllsj.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-gpfpam-shard-0" -> (known after apply)
          ~ standard_srv     = "mongodb+srv://discord-bot.9jyllsj.mongodb.net" -> (known after apply)
        } -> (known after apply)
        create_date                          = "2024-02-20T14:30:25Z"
        encryption_at_rest_provider          = "NONE"
        global_cluster_self_managed_sharding = false
        mongo_db_major_version               = "8.0"
      ~ mongo_db_version                     = "8.0.14" -> (known after apply)
        name                                 = "discord-bot"
        paused                               = false
        pit_enabled                          = false
        project_id                           = "65d4a3bf160f504f2547c2cd"
        redact_client_log_data               = false
      ~ replication_specs                    = [
          ~ {
              ~ container_id   = {} -> (known after apply)
              ~ external_id    = "663bc867b81d1f40d82f9ebb" -> (known after apply)
              ~ region_configs = [
                  ~ {
                      + analytics_auto_scaling = (known after apply)
                      + analytics_specs        = (known after apply)
                      + auto_scaling           = (known after apply)
                        backing_provider_name  = "AZURE"
                      ~ electable_specs        = {
                          + disk_iops       = (known after apply)
                          ~ disk_size_gb    = 0.5 -> (known after apply)
                          ~ ebs_volume_type = "" -> (known after apply)
                            instance_size   = "M0"
                          + node_count      = 1
                        }
                        priority               = 7
                        provider_name          = "TENANT"
                      + read_only_specs        = (known after apply)
                        region_name            = "EUROPE_NORTH"
                    },
                ]
              ~ zone_id        = "6604867f4a528c623b459b50" -> (known after apply)
              ~ zone_name      = "Zone 1" -> (known after apply)
            },
        ]
        root_cert_type                       = "ISRGROOTX1"
      ~ state_name                           = "IDLE" -> (known after apply)
        termination_protection_enabled       = false
        version_release_system               = "LTS"
    }

  # module.mongodb.mongodbatlas_project.project will be updated in-place
~ resource "mongodbatlas_project" "project" {
        id                                               = "65d4a3bf160f504f2547c2cd"
        name                                             = "prod"
      + region_usage_restrictions                        = (known after apply)
        # (12 unchanged attributes hidden)

      - teams {
          - role_names = [
              - "GROUP_OWNER",
            ] -> null
          - team_id    = "65d4f517e098937466fa3e7f" -> null
        }
      - teams {
          - role_names = [
              - "GROUP_READ_ONLY",
            ] -> null
          - team_id    = "65d4a3bee5078405678bbfe3" -> null
        }
    }

Plan: 1 to import, 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to import, 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```